bank_codes = {'Публичное акционерное общество "Сбербанк России"': 'SBR',
              'Банк ВТБ (публичное акционерное общество)': 'VTB',
              'Газпромбанк (Акционерное общество)': 'GPB',
              'Акционерное общество "Российский Сельскохозяйственный банк"': 'RSHB',
              'АКЦИОНЕРНОЕ ОБЩЕСТВО "АЛЬФА-БАНК"': 'ALFA',
              '"МОСКОВСКИЙ КРЕДИТНЫЙ БАНК" (публичное акционерное общество)': 'MKB',
              'Публичное акционерное общество Банк "Финансовая Корпорация Открытие"': 'OPEN',
              'Акционерное общество "Райффайзенбанк"': 'RAIF',
              'Публичное акционерное общество РОСБАНК': 'ROSBANK',
              'Акционерное общество "Всероссийский банк развития регионов"': 'VBRR',
              'Публичное акционерное общество "Промсвязьбанк"': 'PSB',
              'Акционерное общество "Акционерный Банк "РОССИЯ"': 'ROSSIYA',
              'ПУБЛИЧНОЕ АКЦИОНЕРНОЕ ОБЩЕСТВО "БАНК "САНКТ-ПЕТЕРБУРГ"': 'SPB',
              'Публичное акционерное общество "Совкомбанк"': 'SOVCOM',
              'РОССИЙСКИЙ НАЦИОНАЛЬНЫЙ КОММЕРЧЕСКИЙ БАНК (публичное акционерное общество)': 'RNKB',
              'Филиал "Корпоративный" ПАО "Совкомбанк"': 'SOVCOM2',
              'Акционерное общество "ОТП Банк"': 'OTP',
              'Акционерное общество "ЮниКредит Банк"': 'UNIC',
              'Локальный сервер': 'LOCAL'}

type_codes = {'Юридическое лицо': 1,
              'Индивидуальный предприниматель': 2,
              'Физическое лицо': 3}

